W24M09 - Rails Review/tiny-app/app/controllers/pets_controller.rb

  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save
---
INSERT INTO "pets" ("name", "breed", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Chester"], ["breed", "Cat"], ["age", "7"], ["created_at", "2024-03-13 01:38:58.713684"], ["updated_at", "2024-03-13 01:38:58.713684"]]