W24M09 - Rails Review/tiny-app/app/controllers/urls_controller.rb

    def index
        @title = "Hey there Class of September 18, 2023"
        @urls = Url.all
---
SELECT "urls".* FROM "urls"

    def create
        puts "---- Starting adding url ----"
        new_url = {
            longURL: params[:longURL],
            users_id: params[:users_id].to_i,
            shortURL: SecureRandom.base64(6)
        }

        Url.new(new_url).save
---
INSERT INTO "urls" ("longURL", "shortURL", "created_at", "updated_at", "users_id") VALUES (?, ?, ?, ?, ?)  [["longURL", "www.mypage.com"], ["shortURL", "gtRXzSKU"], ["created_at", "2024-03-13 01:31:50.389602"], ["updated_at", "2024-03-13 01:31:50.389602"], ["users_id", 6]]